Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/lcd_draw.c
/*******************************************************************************
* File Name        : lcd_draw.c
*
* Description      : This file implements the direct draw functions to the 
*                    display frame buffer.
*
* Related Document : See README.md
*
********************************************************************************
* (c) 2023-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/******************************************************************************
* Header Files
******************************************************************************/
#include <stdlib.h>
#include "cy_syslib.h"
#include "lcd_graphics.h"
#include "ifx_image_utils.h"

/*******************************************************************************
* Global variables
*******************************************************************************/
static uint32_t    Display_Width = DISPLAY_W;
static uint32_t    Display_Height = DISPLAY_H;
/* foreground / background colors */
static uint32_t    LCD_Colors[2] = {
        0X00000000,     /* background: black */
        0X00FFFFFF      /* foreground: white */
};

/*******************************************************************************
* Functions
*******************************************************************************/

/*******************************************************************************
* Function Name: ifx_lcd_set_Display_size
********************************************************************************
* Summary:
* Sets the display dimensions if the provided width and height are valid 
* (greater than 0).
*
* Parameters:
*  uint32_t width: Width of the display
*  uint32_t height: Height of the display
*
* Return:
*  void
*******************************************************************************/
void ifx_lcd_set_Display_size( uint32_t width, uint32_t height )
{
    Display_Width  = width;
    Display_Height = height;
}

/*******************************************************************************
* Function Name: ifx_lcd_get_Display_Width
********************************************************************************
* Summary:
* Returns the current display width.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current display width
*******************************************************************************/
inline uint32_t ifx_lcd_get_Display_Width()
{
    return Display_Width;
}

/*******************************************************************************
* Function Name: ifx_lcd_get_Display_Height
********************************************************************************
* Summary:
* Returns the current display height.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current display height
*******************************************************************************/
inline uint32_t ifx_lcd_get_Display_Height()
{
    return Display_Height;
}

/*******************************************************************************
* Function Name: bsp_lcd_set_FGcolor
********************************************************************************
* Summary:
* Sets the foreground color for drawing operations, converting RGB888 to either
* RGB565 or XRGB32 based on the display configuration.
*
* Parameters:
*  uint16_t r: Red color value (0-255)
*  uint16_t g: Green color value (0-255)
*  uint16_t b: Blue color value (0-255)
*
* Return:
*  uint32_t: The set foreground color value
*******************************************************************************/
uint32_t bsp_lcd_set_FGcolor( uint16_t r, uint16_t g, uint16_t b )
{
    LCD_Colors[1] =
#ifndef LCD_COLOR_XRGB32
    ifx_pixel_RGB888_to_RGB565(r, g, b);
#else
    ifx_pixel_RGB888_to_RGBX32(r, g, b);
#endif  /* LCD_COLOR_XRGB32*/

    return LCD_Colors[1];
}


/*******************************************************************************
* Function Name: bsp_lcd_set_BGcolor
********************************************************************************
* Summary:
* Sets the background color for drawing operations, converting RGB888 to either
* RGB565 or XRGB32 based on the display configuration.
*
* Parameters:
*  uint16_t r: Red color value (0-255)
*  uint16_t g: Green color value (0-255)
*  uint16_t b: Blue color value (0-255)
*
* Return:
*  uint32_t: The set background color value
*******************************************************************************/
uint32_t bsp_lcd_set_BGcolor( uint16_t r, uint16_t g, uint16_t b )
{
    LCD_Colors[0] =
#ifndef LCD_COLOR_XRGB32
    ifx_pixel_RGB888_to_RGB565(r, g, b);
#else
    ifx_pixel_RGB888_to_RGBX32(r, g, b);
#endif  /* LCD_COLOR_XRGB32*/

    return LCD_Colors[0];
}


