Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/lcd_draw.c
/*******************************************************************************
* Function Name: bsp_lcd_get_FGcolor
********************************************************************************
* Summary:
* Returns the current foreground color.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current foreground color value
*******************************************************************************/
uint32_t bsp_lcd_get_FGcolor()
{
    return LCD_Colors[1];
}


/*******************************************************************************
* Function Name: bsp_lcd_get_BGcolor
********************************************************************************
* Summary:
* Returns the current background color.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current background color value
*******************************************************************************/
uint32_t bsp_lcd_get_BGcolor()
{
    return LCD_Colors[0];
}
/*******************************************************************************
* Function Name: ifx_lcd_set_FGcolor
********************************************************************************
* Summary:
* Sets the foreground color using 8-bit RGB values, forwarding to the BSP 
* function.
*
* Parameters:
*  uint8_t r: Red color value (0-255)
*  uint8_t g: Green color value (0-255)
*  uint8_t b: Blue color value (0-255)
*
* Return:
*  uint32_t: The set foreground color value
*******************************************************************************/
inline uint32_t ifx_lcd_set_FGcolor( uint8_t r, uint8_t g, uint8_t b )
{
    return bsp_lcd_set_FGcolor( r, g, b );
}

/*******************************************************************************
* Function Name: ifx_lcd_set_BGcolor
********************************************************************************
* Summary:
* Sets the background color using 8-bit RGB values, forwarding to the BSP function.
*
* Parameters:
*  uint8_t r: Red color value (0-255)
*  uint8_t g: Green color value (0-255)
*  uint8_t b: Blue color value (0-255)
*
* Return:
*  uint32_t: The set background color value
*******************************************************************************/
inline uint32_t ifx_lcd_set_BGcolor( uint8_t r, uint8_t g, uint8_t b )
{
    return bsp_lcd_set_BGcolor( r, g, b );
}

/*******************************************************************************
* Function Name: ifx_lcd_get_FGcolor
********************************************************************************
* Summary:
* Returns the current foreground color, forwarding to the BSP function.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current foreground color value
*******************************************************************************/
inline uint32_t ifx_lcd_get_FGcolor()
{
    return bsp_lcd_get_FGcolor();
}

/*******************************************************************************
* Function Name: ifx_lcd_get_BGcolor
********************************************************************************
* Summary:
* Returns the current background color, forwarding to the BSP function.
*
* Parameters:
*  void
*
* Return:
*  uint32_t: Current background color value
*******************************************************************************/
inline uint32_t ifx_lcd_get_BGcolor()
{
    return bsp_lcd_get_BGcolor();
}
 

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: bsp_lcd_draw_Pixel
********************************************************************************
* Summary:
* Draws a single pixel at the specified coordinates with the given RGB color.
* Assumes the coordinates are valid within the display boundaries.
*
* Parameters:
*  uint16_t x: X-coordinate of the pixel
*  uint16_t y: Y-coordinate of the pixel
*  uint32_t rgbColor: 16-bit RGB565 or 32-bit XRGB color value
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_draw_Pixel( uint16_t x, uint16_t y, uint32_t rgbColor )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    LCD_Addr[INDEX2D(y, x, Display_Width)] = rgbColor;
}
CY_SECTION_ITCM_END


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: bsp_lcd_draw_H_Line
********************************************************************************
* Summary:
* Draws a horizontal line from x0 to x1 at y0 with the specified RGB color.
* Assumes x0 <= x1 and coordinates are valid within the display boundaries.
*
* Parameters:
*  uint16_t x0: Starting X-coordinate
*  uint16_t y0: Y-coordinate of the line
*  uint16_t x1: Ending X-coordinate
*  uint32_t rgbColor: 16-bit RGB565 or 32-bit XRGB color value
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_draw_H_Line( uint16_t x0, uint16_t y0, uint16_t x1, uint32_t rgbColor )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    uint32_t   kk = INDEX2D(y0, x0, Display_Width);

    for ( uint32_t x = x0; x <= x1; x++ )
        LCD_Addr[kk++] = rgbColor;
}
CY_SECTION_ITCM_END


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: bsp_lcd_draw_V_Line
********************************************************************************
* Summary:
* Draws a vertical line from y0 to y1 at x0 with the specified RGB color.
* Assumes y0 <= y1 and coordinates are valid within the display boundaries.
*
* Parameters:
*  uint16_t x0: X-coordinate of the line
*  uint16_t y0: Starting Y-coordinate
*  uint16_t y1: Ending Y-coordinate
*  uint32_t rgbColor: 16-bit RGB565 or 32-bit XRGB color value
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_draw_V_Line( uint16_t x0, uint16_t y0, uint16_t y1, uint32_t rgbColor )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    uint32_t    kk = INDEX2D(y0, x0, Display_Width);

    for ( uint32_t y = y0; y <= y1; y++, kk += Display_Width )
        LCD_Addr[kk] = rgbColor;
}
CY_SECTION_ITCM_END

