Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/lcd_draw.c
/*******************************************************************************
* Function Name: ifx_lcd_draw_Pixel
********************************************************************************
* Summary:
* Draws a single pixel at the specified coordinates with the given color.
* Assumes the coordinates are valid within the display boundaries.
*
* Parameters:
*  uint16_t x: X-coordinate of the pixel
*  uint16_t y: Y-coordinate of the pixel
*  uint32_t color: Foreground or background color value
*
* Return:
*  void
*******************************************************************************/
inline void ifx_lcd_draw_Pixel( uint16_t x, uint16_t y, uint32_t color )
{
    bsp_lcd_draw_Pixel( x, y, color );
}


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: ifx_lcd_draw_H_Line
********************************************************************************
* Summary:
* Draws a horizontal line from x0 to x1 at y0 using the current foreground color.
* Clips the line to the display boundaries.
*
* Parameters:
*  int16_t x0: Starting X-coordinate
*  int16_t y0: Y-coordinate of the line
*  int16_t x1: Ending X-coordinate
*
* Return:
*  void

******************************************************************************/
void ifx_lcd_draw_H_Line( int16_t x0, int16_t y0, int16_t x1 )
{
    int min_x = min(x0, x1);
    int max_x = max(x0, x1);

    /* check if the whole line is out of the display */
    if ( max_x < 0  ||  y0 < 0  ||  Display_Width <= min_x  ||  Display_Height <= y0 )
        return;

    uint32_t    fgColor = ifx_lcd_get_FGcolor();

    bsp_lcd_draw_H_Line( (uint16_t) max(min_x, 0), (uint16_t) y0, (uint16_t) min(max_x, Display_Width - 1), fgColor );
}
CY_SECTION_ITCM_END


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: ifx_lcd_draw_V_Line
********************************************************************************
* Summary:
* Draws a vertical line from y0 to y1 at x0 using the current foreground color.
* Clips the line to the display boundaries.
*
* Parameters:
*  int16_t x0: X-coordinate of the line
*  int16_t y0: Starting Y-coordinate
*  int16_t y1: Ending Y-coordinate
*
* Return:
*  void
*******************************************************************************/
void ifx_lcd_draw_V_Line( int16_t x0, int16_t y0, int16_t y1 )
{
    int min_y = min(y0, y1);
    int max_y = max(y0, y1);

    /* check if the whole line is out of the display*/
    if ( x0 < 0  ||  max_y < 0  || Display_Width <= x0  ||  Display_Height <= min_y )
        return;

    uint32_t    fgColor = ifx_lcd_get_FGcolor();

    bsp_lcd_draw_V_Line( (uint16_t) x0, (uint16_t) max(min_y, 0), (uint16_t) min(max_y, Display_Height - 1), fgColor );
}
CY_SECTION_ITCM_END

/*******************************************************************************
* Function Name: ifx_lcd_draw_Line
********************************************************************************
* Summary:
* Draws a line from (x0, y0) to (x1, y1) using the current foreground color.
* Handles vertical, horizontal, and diagonal lines, clipping to display 
* boundaries.
*
* Parameters:
*  int16_t x0: Starting X-coordinate
*  int16_t y0: Starting Y-coordinate
*  int16_t x1: Ending X-coordinate
*  int16_t y1: Ending Y-coordinate
*
* Return:
*  void
*******************************************************************************/
 CY_SECTION_ITCM_BEGIN
void ifx_lcd_draw_Line( int16_t x0, int16_t y0, int16_t x1, int16_t y1 )
{
    int min_x = min(x0, x1);
    int max_x = max(x0, x1);
    int min_y = min(y0, y1);
    int max_y = max(y0, y1);
    uint32_t    fgColor = ifx_lcd_get_FGcolor();
    int16_t     tmp;

    /* check if the whole line is out of the display */
    if ( max_x < 0  ||  max_y < 0  ||  Display_Width <= min_x  ||  Display_Height <= min_y )
        return;

    if ( x0 == x1 )
    {
        if ( y0 == y1 )
        {
            ifx_lcd_draw_Pixel( (uint16_t)x0, (uint16_t)y0, fgColor );
        } 
        else
        {
            /* Vertical line */
            min_y = max(min_y, 0);
            max_y = min(max_y, Display_Height - 1);
            bsp_lcd_draw_V_Line( (uint16_t) x0, (uint16_t) min_y, (uint16_t) max_y, fgColor );
        }
        return;
    } 
    else if ( y0 == y1 )
    {
        /* Horizontal line */
        min_x = max(min_x, 0);
        max_x = min(max_x, Display_Width - 1);
        bsp_lcd_draw_H_Line( (uint16_t) min_x, (uint16_t) y0, (uint16_t) max_x, fgColor );
        return;
    }

    if ( max_x - min_x >= max_y - min_y )
    {
        if ( x0 > x1 )
        {
            swap( x0, x1, tmp );
            swap( y0, y1, tmp );
        }

        float   dx = x1 - x0;
        float   dy = y1 - y0;
        float   k  = dy / dx;
        float   fy = y0 + 0.5f;
        uint16_t    min_x = x0;
        uint16_t    max_x = min( x1, Display_Width - 1 );

        if ( x0 < 0 )
        {
            /* Move to the valid display area in X */
            fy -= k * x0;
            min_x = 0;
        }
        for ( uint16_t ix = min_x; ix <= max_x; ix++, fy += k )
        {
            int16_t iy = fy;
            if ( 0 <= iy  &&  iy < Display_Height )
                ifx_lcd_draw_Pixel( ix, (uint16_t)iy, fgColor );
        }
    }
    else
    {
        if ( y0 > y1 )
        {
            swap( x0, x1, tmp );
            swap( y0, y1, tmp );
        }

        float   dx = x1 - x0;
        float   dy = y1 - y0;
        float   k  = dx / dy;
        float   fx = x0 + 0.5f;
        uint16_t    min_y = y0;
        uint16_t    max_y = min( y1, Display_Height - 1 );

        if ( y0 < 0 )
        {
            /* Move to the valid display area in Y */
            fx -= k * y0;
            min_y = 0;
        }
        for ( uint16_t iy = min_y; iy <= max_y; iy++, fx += k )
        {
            int16_t ix = fx;
            if ( 0 <= ix  &&  ix < Display_Width )
                ifx_lcd_draw_Pixel( (uint16_t)ix, iy, fgColor );
        }
    }
}
CY_SECTION_ITCM_END


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: ifx_lcd_draw_Rect
********************************************************************************
* Summary:
* Draws a rectangle outline defined by opposite corners (x0, y0) and (x1, y1)
* using the current foreground color. Clips the rectangle to the display 
* boundaries.
*
* Parameters:
*  int16_t x0: X-coordinate of one corner
*  int16_t y0: Y-coordinate of one corner
*  int16_t x1: X-coordinate of the opposite corner
*  int16_t y1: Y-coordinate of the opposite corner
*
* Return:
*  void
*******************************************************************************/
void ifx_lcd_draw_Rect( int16_t x0, int16_t y0, int16_t x1, int16_t y1 )
{
    int min_x = min(x0, x1);
    int max_x = max(x0, x1);
    int min_y = min(y0, y1);
    int max_y = max(y0, y1);

    /* check if the whole line is out of the display*/
    if ( max_x < 0  ||  max_y < 0  ||  Display_Width <= min_x  ||  Display_Height <= min_y )
        return;

    uint32_t    fgColor = ifx_lcd_get_FGcolor();

    bsp_lcd_draw_H_Line( min_x, min_y, max_x, fgColor );
    bsp_lcd_draw_V_Line( min_x, min_y, max_y, fgColor );
    bsp_lcd_draw_H_Line( min_x, max_y, max_x, fgColor );
    bsp_lcd_draw_V_Line( max_x, min_y, max_y, fgColor );
}
CY_SECTION_ITCM_END

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: ifx_lcd_draw_Bitmap
********************************************************************************
* Summary:
* Draws a monochrome bitmap at the specified coordinates using foreground and
* background colors. Each bit in the bitmap determines whether to use the
* foreground or background color.
*
* Parameters:
*  int16_t x: X-coordinate of the top-left corner
*  int16_t y: Y-coordinate of the top-left corner
*  const char*bitmap: Pointer to the bitmap data
*  uint16_t width: Width of the bitmap in pixels
*  uint16_t height: Height of the bitmap in pixels
*
* Return:
*  void
*******************************************************************************/
void ifx_lcd_draw_Bitmap( int16_t x, int16_t y, const char *bitmap, uint16_t width, uint16_t height )
{
    if ( x < 0  ||  Display_Width  < x + width  ||
         y < 0  ||  Display_Height < y + height )
        return;

    uint32_t    fgColor = ifx_lcd_get_FGcolor();
    uint32_t    bgColor = ifx_lcd_get_BGcolor();
    const char  *pBitmap = bitmap;
    int         width_byte = width / 8;     /* round down to BYTE unit */

    for ( int j = 0; j < width_byte; j++, x += 8 )
    {
        for ( int pos = 0; pos < height; pos++ )
        {
            uint8_t byte = (uint8_t) *pBitmap++;

            for ( int t = 0; t < 8; t++ )
            {
                uint32_t    color = ( (byte << t) & 0x80u ) ? fgColor : bgColor;

