Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/lcd_draw.c
                ifx_lcd_draw_Pixel( x + t, y + pos, color );
            }
        }
    }
    if ( width % 8 )
    {
        for ( int pos = 0; pos < height; pos++ )
        {
            uint8_t byte = (uint8_t) *pBitmap++;

            for ( int t = 0; t < width % 8; t++ )
            {
                uint32_t    color = ( (byte << t) & 0x80u ) ? fgColor : bgColor;

                ifx_lcd_draw_Pixel( x + t, y + pos, color );
            }
        }
    }
}
CY_SECTION_ITCM_END


/*******************************************************************************
* Function Name: bsp_lcd_display_Rect
********************************************************************************
* Summary:
* Copies a rectangular area from a 24-bit RGB source image to the specified
* location on the display, converting to the display's color format (RGB565 
* or XRGB32).
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  uint8_t *image: Pointer to the 24-bit RGB source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_display_Rect( uint16_t x0, uint16_t y0, uint8_t *image, uint16_t width, uint16_t height )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    /* check if the whole line is out of the display */
    if ( x0 >= Display_Width  ||  y0 >= Display_Height )
        return;

    uint32_t    h = min( height, Display_Height - y0 );
    uint32_t    w = min( width,  Display_Width - x0 );
    uint8_t     *pSrc = image;
    LCD_TYPE_t  *pDst = &LCD_Addr[INDEX2D(y0, x0, Display_Width)];

    for ( uint32_t y = 0; y < h; y++ ) 
    {
        uint8_t *ps = pSrc;

        for ( uint32_t x = 0; x < w; x++ ) 
        {
            uint32_t    r = (uint32_t)(*ps++);
            uint32_t    g = (uint32_t)(*ps++);
            uint32_t    b = (uint32_t)(*ps++);

            pDst[x] =
#ifndef LCD_COLOR_XRGB32
            (uint16_t)ifx_pixel_RGB888_to_RGB565( b, g, r );
#else
            (uint32_t)ifx_pixel_RGB888_to_RGBX32( r, g, b );
#endif  /* LCD_COLOR_XRGB32 */
        }
        pDst += Display_Width;
        pSrc += width * 3;
    }
}


/*******************************************************************************
* Function Name: bsp_lcd_display_Rect_i8
********************************************************************************
* Summary:
* Copies a rectangular area from an int8-normalized 24-bit RGB source image to
* the specified location on the display, converting to the display's color format
* (RGB565 or XRGB32) after offsetting by 128.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  int8_t *image_i8: Pointer to the int8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_display_Rect_i8( uint16_t x0, uint16_t y0, int8_t *image_i8, uint16_t width, uint16_t height )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    /* check if the whole line is out of the display */
    if ( x0 >= Display_Width  ||  y0 >= Display_Height )
        return;

    uint32_t    h = min( height, Display_Height - y0 );
    uint32_t    w = min( width,  Display_Width - x0 );
    int8_t      *pSrc = image_i8;
    LCD_TYPE_t  *pDst = &LCD_Addr[INDEX2D(y0, x0, Display_Width)];

    for ( uint32_t y = 0; y < h; y++ ) {
        int8_t      *ps = pSrc;

        for ( uint32_t x = 0; x < w; x++ ) {
            uint32_t    r = (uint32_t)(*ps++ + 128);
            uint32_t    g = (uint32_t)(*ps++ + 128);
            uint32_t    b = (uint32_t)(*ps++ + 128);

            pDst[x] =
#ifndef LCD_COLOR_XRGB32
            (uint16_t)ifx_pixel_RGB888_to_RGB565( b, g, r );
#else
            (uint32_t)ifx_pixel_RGB888_to_RGBX32( r, g, b );
#endif  /* LCD_COLOR_XRGB32 */
        }
        pDst += Display_Width;
        pSrc += width * 3;
    }
}


/*******************************************************************************
* Function Name: bsp_lcd_display_Rect_ui8
********************************************************************************
* Summary:
* Copies a rectangular area from a uint8-normalized 24-bit RGB source image to
* the specified location on the display, converting to the display's color format
* (RGB565 or XRGB32).
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  uint8_t *image_ui8: Pointer to the uint8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
void bsp_lcd_display_Rect_ui8( uint16_t x0, uint16_t y0, uint8_t *image_ui8, uint16_t width, uint16_t height )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    /* check if the whole line is out of the display */
    if ( x0 >= Display_Width  ||  y0 >= Display_Height )
        return;

    uint32_t    h = min( height, Display_Height - y0 );
    uint32_t    w = min( width,  Display_Width - x0 );
    uint8_t      *pSrc = image_ui8;
    LCD_TYPE_t  *pDst = &LCD_Addr[y0 * Display_Width + x0];

    for ( uint32_t y = 0; y < h; y++ ) {
        uint8_t      *ps = pSrc;

        for ( uint32_t x = 0; x < w; x++ ) {
            uint32_t    r = (uint32_t)(*ps++);
            uint32_t    g = (uint32_t)(*ps++);
            uint32_t    b = (uint32_t)(*ps++);

            pDst[x] =
#ifndef LCD_COLOR_XRGB32
            (uint16_t)ifx_pixel_RGB888_to_RGB565( b, g, r );
#else
            (uint32_t)ifx_pixel_RGB888_to_RGBX32( r, g, b );
#endif  /* LCD_COLOR_XRGB32 */
        }
        pDst += Display_Width;
        pSrc += width * 3;
    }
}


