Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/lcd_draw.c
/*******************************************************************************
* Function Name: bsp_lcd_display_Rect_scale_i8
********************************************************************************
* Summary:
* Copies a rectangular area from an int8-normalized source image to the specified
* location on the display with an integer scale factor (>= 1), converting to the
* display's color format (RGB565 or XRGB32) after offsetting by 128.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  int8_t *pSrc: Pointer to the int8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*  uint16_t scale: Integer scale factor (>= 1)
*
* Onderwerp: Re: Request for code review and optimization suggestions
* Return:
*  void
*******************************************************************************/
void bsp_lcd_display_Rect_scale_i8( uint16_t x0, uint16_t y0, int8_t *pSrc, uint16_t width, uint16_t height, uint16_t scale )
{
    if (Display_Width == 0 || Display_Height == 0) return;

    uint32_t    h = min( height, (Display_Height - y0) / scale );
    uint32_t    w = min( width,  (Display_Width - x0) / scale );

    for ( uint32_t y = 0; y < h; y++ ) {
        int8_t      *ps = &pSrc[y * width * 3];
        LCD_TYPE_t  *pd = &LCD_Addr[(y0 + y * scale) * Display_Width + x0];

        for ( uint32_t x = 0; x < w; x++ ) {
            uint32_t    r = (uint32_t)(*ps++ + 128);
            uint32_t    g = (uint32_t)(*ps++ + 128);
            uint32_t    b = (uint32_t)(*ps++ + 128);
            uint32_t    color =
#ifndef LCD_COLOR_XRGB32
            ifx_pixel_RGB888_to_RGB565( b, g, r );
#else
            ifx_pixel_RGB888_to_RGBX32( r, g, b );
#endif  /* LCD_COLOR_XRGB32 */

            for ( int ky = 0; ky < scale; ky++ )
                for ( int kx = 0; kx < scale; kx++ )
                    pd[INDEX2D(ky, kx, Display_Width)] = color;

            pd += scale;
        }
    }
}

/*******************************************************************************
* Function Name: ifx_lcd_display_Rect
********************************************************************************
* Summary:
* Copies a rectangular area from a 24-bit RGB source image to the specified
* location on the display, forwarding to the BSP function.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  uint8_t *image: Pointer to the 24-bit RGB source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
inline void ifx_lcd_display_Rect( uint16_t x0, uint16_t y0, uint8_t *image, uint16_t width, uint16_t height )
{
    bsp_lcd_display_Rect( x0, y0, image, width, height );
}

/*******************************************************************************
* Function Name: ifx_lcd_display_Rect_i8
********************************************************************************
* Summary:
* Copies a rectangular area from an int8-normalized source image to the specified
* location on the display, forwarding to the BSP function.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  int8_t *image_i8: Pointer to the int8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
inline void ifx_lcd_display_Rect_i8( uint16_t x0, uint16_t y0, int8_t *image_i8, uint16_t width, uint16_t height )
{
    bsp_lcd_display_Rect_i8( x0, y0, image_i8, width, height );
}


/*******************************************************************************
* Function Name: ifx_lcd_display_Rect_ui8
********************************************************************************
* Summary:
* Copies a rectangular area from a uint8-normalized source image to the specified
* location on the display, forwarding to the BSP function.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  uint8_t *image_ui8: Pointer to the uint8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*
* Return:
*  void
*******************************************************************************/
inline void ifx_lcd_display_Rect_ui8( uint16_t x0, uint16_t y0, uint8_t *image_ui8, uint16_t width, uint16_t height )
{
    bsp_lcd_display_Rect_ui8( x0, y0, image_ui8, width, height );
}

/*******************************************************************************
* Function Name: ifx_lcd_display_Rect_scale_i8
********************************************************************************
* Summary:
* Copies a rectangular area from an int8-normalized source image to the specified
* location on the display with an integer scale factor (>= 1), forwarding to the
* BSP function.
*
* Parameters:
*  uint16_t x0: X-coordinate of the top-left corner on the display
*  uint16_t y0: Y-coordinate of the top-left corner on the display
*  int8_t *image_i8: Pointer to the int8-normalized source image
*  uint16_t width: Width of the source image
*  uint16_t height: Height of the source image
*  uint16_t scale: Integer scale factor (>= 1)
*
* Return:
*  void
*******************************************************************************/
inline
void ifx_lcd_display_Rect_scale_i8( uint16_t x0, uint16_t y0, int8_t *image_i8, uint16_t width, uint16_t height, uint16_t scale )
{
    bsp_lcd_display_Rect_scale_i8( x0, y0, image_i8, width, height, scale );
}

/* [] END OF FILE */
